; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v5 ?v13)
             (pred_3 ?v6 ?v2)
             (pred_9 ?v5 ?v2)
             (pred_10 ?v12 ?v5 )
	     (pred_5 ?v5)
             (pred_1 ?v11)
             (pred_11 ?v6)
             (pred_6 ?v2)
             (pred_8 ?v5)
             (pred_4 ?v6)
             (pred_12 ?v5)
             (pred_2 ))



(:action op_3
:parameters (?v7 ?v3 ?v1 ?v10)
:precondition (and (pred_1 ?v7) (pred_1 ?v3) (pred_11 ?v1) (pred_6 ?v10)
          (pred_7 ?v7 ?v3) (pred_3 ?v1 ?v10)
                   (pred_9 ?v3 ?v10) (pred_5 ?v7) 
                   (pred_8 ?v3) (pred_4 ?v1))
:effect (and  (pred_12 ?v3) (not (pred_8 ?v3))))


(:action op_5
:parameters (?v7 ?v4)
:precondition (and (pred_1 ?v7) (pred_1 ?v4)
               (pred_5 ?v7) (pred_7 ?v7 ?v4) (pred_12 ?v4))
:effect (and (pred_5 ?v4) (not (pred_5 ?v7))))

(:action op_2
:parameters (?v7 ?v1)
:precondition (and (pred_1 ?v7) (pred_11 ?v1) 
                  (pred_5 ?v7) (pred_10 ?v1 ?v7) (pred_2 ))
:effect (and (pred_4 ?v1)
   (not (pred_10 ?v1 ?v7)) (not (pred_2 ))))


(:action op_1
:parameters (?v7 ?v8 ?v9)
:precondition (and (pred_1 ?v7) (pred_11 ?v8) (pred_11 ?v9)
                  (pred_5 ?v7) (pred_4 ?v9) (pred_10 ?v8 ?v7))
:effect (and (pred_4 ?v8) (pred_10 ?v9 ?v7)
        (not (pred_4 ?v9)) (not (pred_10 ?v8 ?v7))))

(:action op_4
:parameters (?v7 ?v1)
:precondition (and (pred_1 ?v7) (pred_11 ?v1) 
                  (pred_5 ?v7) (pred_4 ?v1))
:effect (and (pred_2 ) (pred_10 ?v1 ?v7) (not (pred_4 ?v1)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_02 obj_03 obj_15 obj_22 obj_06 obj_14 obj_17 obj_20 obj_12 obj_01 obj_19 obj_13 obj_09 obj_10 obj_16
    obj_18 obj_05 obj_04
    obj_11 obj_07 obj_08
    )

    (:init
       (pred_2)

       (pred_1 obj_21)
       (pred_1 obj_02)
       (pred_1 obj_03)
       (pred_1 obj_15)
       (pred_1 obj_22)
       (pred_1 obj_06)
       (pred_1 obj_14)
       (pred_1 obj_17)
       (pred_1 obj_20)
       (pred_1 obj_12)
       (pred_1 obj_01)
       (pred_1 obj_19)
       (pred_1 obj_13)
       (pred_1 obj_09)
       (pred_1 obj_10)
       (pred_1 obj_16)
       (pred_6 obj_18)
       (pred_6 obj_05)
       (pred_6 obj_04)
       (pred_11 obj_11)
       (pred_11 obj_07)
       (pred_11 obj_08)

       (pred_7 obj_21 obj_22)
       (pred_7 obj_21 obj_02)
       (pred_7 obj_02 obj_06)
       (pred_7 obj_02 obj_03)
       (pred_7 obj_02 obj_21)
       (pred_7 obj_03 obj_14)
       (pred_7 obj_03 obj_15)
       (pred_7 obj_03 obj_02)
       (pred_7 obj_15 obj_17)
       (pred_7 obj_15 obj_03)
       (pred_7 obj_22 obj_20)
       (pred_7 obj_22 obj_06)
       (pred_7 obj_22 obj_21)
       (pred_7 obj_06 obj_12)
       (pred_7 obj_06 obj_14)
       (pred_7 obj_06 obj_02)
       (pred_7 obj_06 obj_22)
       (pred_7 obj_14 obj_01)
       (pred_7 obj_14 obj_17)
       (pred_7 obj_14 obj_03)
       (pred_7 obj_14 obj_06)
       (pred_7 obj_17 obj_19)
       (pred_7 obj_17 obj_15)
       (pred_7 obj_17 obj_14)
       (pred_7 obj_20 obj_13)
       (pred_7 obj_20 obj_12)
       (pred_7 obj_20 obj_22)
       (pred_7 obj_12 obj_09)
       (pred_7 obj_12 obj_01)
       (pred_7 obj_12 obj_06)
       (pred_7 obj_12 obj_20)
       (pred_7 obj_01 obj_10)
       (pred_7 obj_01 obj_19)
       (pred_7 obj_01 obj_14)
       (pred_7 obj_01 obj_12)
       (pred_7 obj_19 obj_16)
       (pred_7 obj_19 obj_17)
       (pred_7 obj_19 obj_01)
       (pred_7 obj_13 obj_09)
       (pred_7 obj_13 obj_20)
       (pred_7 obj_09 obj_10)
       (pred_7 obj_09 obj_12)
       (pred_7 obj_09 obj_13)
       (pred_7 obj_10 obj_16)
       (pred_7 obj_10 obj_01)
       (pred_7 obj_10 obj_09)
       (pred_7 obj_16 obj_19)
       (pred_7 obj_16 obj_10)
       (pred_8 obj_20)
       (pred_8 obj_17)
       (pred_8 obj_16)
       (pred_9  obj_20 obj_18)
       (pred_9  obj_17 obj_05)
       (pred_9  obj_16 obj_04)
       (pred_12 obj_21)
       (pred_12 obj_02)
       (pred_12 obj_03)
       (pred_12 obj_15)
       (pred_12 obj_22)
       (pred_12 obj_06)
       (pred_12 obj_14)
       (pred_12 obj_12)
       (pred_12 obj_01)
       (pred_12 obj_19)
       (pred_12 obj_13)
       (pred_12 obj_09)
       (pred_12 obj_10)

       (pred_3  obj_11 obj_18)
       (pred_3  obj_07 obj_05)
       (pred_3  obj_08 obj_04)
       (pred_10 obj_11 obj_09)
       (pred_10 obj_07 obj_03)
       (pred_10 obj_08 obj_12)
       (pred_5 obj_01)
    )

    (:goal (and
       (pred_10 obj_11 obj_20)
       (pred_10 obj_07 obj_10)
       (pred_10 obj_08 obj_02)
    ))
(:constraints
  (always (not (pred_5 obj_14)))
)
)

; plan
1. (op_5 obj_01 obj_10)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_10)
   goals met: 0 of 3
2. (op_5 obj_10 obj_09)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_09)
   goals met: 0 of 3
3. (op_2 obj_09 obj_11)
   deleted: (pred_10 obj_11 obj_09) (pred_2)
   added: (pred_4 obj_11)
   goals met: 0 of 3
4. (op_5 obj_09 obj_10)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_10)
   goals met: 0 of 3
5. (op_5 obj_10 obj_01)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_01)
   goals met: 0 of 3
6. (op_5 obj_01 obj_12)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_12)
   goals met: 0 of 3
7. (op_3 obj_12 obj_20 obj_11 obj_18)
   deleted: (pred_8 obj_20)
   added: (pred_12 obj_20)
   goals met: 0 of 3
8. (op_5 obj_12 obj_01)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_01)
   goals met: 0 of 3
9. (op_5 obj_01 obj_10)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_10)
   goals met: 0 of 3
10. (op_4 obj_10 obj_11)
   deleted: (pred_4 obj_11)
   added: (pred_2) (pred_10 obj_11 obj_10)
   goals met: 0 of 3
11. (op_5 obj_10 obj_01)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_01)
   goals met: 0 of 3
12. (op_5 obj_01 obj_12)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_12)
   goals met: 0 of 3
13. (op_2 obj_12 obj_08)
   deleted: (pred_10 obj_08 obj_12) (pred_2)
   added: (pred_4 obj_08)
   goals met: 0 of 3
14. (op_5 obj_12 obj_06)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_06)
   goals met: 0 of 3
15. (op_5 obj_06 obj_02)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_02)
   goals met: 0 of 3
16. (op_4 obj_02 obj_08)
   deleted: (pred_4 obj_08)
   added: (pred_2) (pred_10 obj_08 obj_02)
   goals met: 1 of 3
17. (op_5 obj_02 obj_03)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_03)
   goals met: 1 of 3
18. (op_2 obj_03 obj_07)
   deleted: (pred_10 obj_07 obj_03) (pred_2)
   added: (pred_4 obj_07)
   goals met: 1 of 3
19. (op_5 obj_03 obj_02)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_02)
   goals met: 1 of 3
20. (op_5 obj_02 obj_21)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_21)
   goals met: 1 of 3
21. (op_5 obj_21 obj_22)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_22)
   goals met: 1 of 3
22. (op_5 obj_22 obj_20)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_20)
   goals met: 1 of 3
23. (op_5 obj_20 obj_12)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_12)
   goals met: 1 of 3
24. (op_5 obj_12 obj_01)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_01)
   goals met: 1 of 3
25. (op_5 obj_01 obj_10)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_10)
   goals met: 1 of 3
26. (op_1 obj_10 obj_11 obj_07)
   deleted: (pred_4 obj_07) (pred_10 obj_11 obj_10)
   added: (pred_4 obj_11) (pred_10 obj_07 obj_10)
   goals met: 2 of 3
27. (op_5 obj_10 obj_01)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_01)
   goals met: 2 of 3
28. (op_5 obj_01 obj_12)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_12)
   goals met: 2 of 3
29. (op_5 obj_12 obj_20)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_20)
   goals met: 2 of 3
30. (op_4 obj_20 obj_11)
   deleted: (pred_4 obj_11)
   added: (pred_2) (pred_10 obj_11 obj_20)
   goals met: 3 of 3
